In [1]:
import pandas as pd

data = {
    "employee_id": [101,102,103,104,105,106,107,108,109,110,111,112],
    "name": ["Ali","Sara","John","Ayesha","Bilal","Emma","David","Fatima","Omar","Sophia","Hassan","Lily"],
    "department": ["AI","Web","AI","HR","Web","AI","HR","Web","AI","HR","Web","AI"],
    "age": [22,25,24,28,23,26,30,27,29,31,24,22],
    "experience_years": [1,3,2,5,1,4,6,3,5,7,2,1],
    "salary": [60000,75000,68000,50000,72000,82000,52000,76000,90000,54000,71000,61000],
    "performance_score": [8,7,9,6,7,9,5,8,9,6,7,8]
}

df = pd.DataFrame(data)
df

,employee_id,name,department,age,experience_years,salary,performance_score
0,101,Ali,AI,22,1,60000,8
1,102,Sara,Web,25,3,75000,7
2,103,John,AI,24,2,68000,9
3,104,Ayesha,HR,28,5,50000,6
4,105,Bilal,Web,23,1,72000,7
5,106,Emma,AI,26,4,82000,9
6,107,David,HR,30,6,52000,5
7,108,Fatima,Web,27,3,76000,8
8,109,Omar,AI,29,5,90000,9
9,110,Sophia,HR,31,7,54000,6
10,111,Hassan,Web,24,2,71000,7
11,112,Lily,AI,22,1,61000,8

In [2]:
df.head()

,employee_id,name,department,age,experience_years,salary,performance_score
0,101,Ali,AI,22,1,60000,8
1,102,Sara,Web,25,3,75000,7
2,103,John,AI,24,2,68000,9
3,104,Ayesha,HR,28,5,50000,6
4,105,Bilal,Web,23,1,72000,7

In [3]:
df.shape

(12, 7)

In [4]:
df.dtypes

employee_id           int64
name                 object
department           object
age                   int64
experience_years      int64
salary                int64
performance_score     int64
dtype: object

In [5]:
df.describe()

,employee_id,age,experience_years,salary,performance_score
count,12.000000,12.000000,12.000000,12.000000,12.000000
mean,106.500000,25.916667,3.333333,67583.333333,7.416667
std,3.605551,3.088346,2.059715,12449.595345,1.311372
min,101.000000,22.000000,1.000000,50000.000000,5.000000
25%,103.750000,23.750000,1.750000,58500.000000,6.750000
50%,106.500000,25.500000,3.000000,69500.000000,7.500000
75%,109.250000,28.250000,5.000000,75250.000000,8.250000
max,112.000000,31.000000,7.000000,90000.000000,9.000000

In [6]:
df["salary"]

0     60000
1     75000
2     68000
3     50000
4     72000
5     82000
6     52000
7     76000
8     90000
9     54000
10    71000
11    61000
Name: salary, dtype: int64

In [7]:
df[["name","salary"]]

      name  salary
0      Ali   60000
1     Sara   75000
2     John   68000
3   Ayesha   50000
4    Bilal   72000
5     Emma   82000
6    David   52000
7   Fatima   76000
8     Omar   90000
9   Sophia   54000
10  Hassan   71000
11    Lily   61000

In [8]:
df.loc[0]

employee_id            101
name                   Ali
department              AI
age                     22
experience_years         1
salary               60000
performance_score        8
Name: 0, dtype: object

In [9]:
ai_employees = df[df["department"] == "AI"]
ai_employees

,employee_id,name,department,age,experience_years,salary,performance_score
0,101,Ali,AI,22,1,60000,8
2,103,John,AI,24,2,68000,9
5,106,Emma,AI,26,4,82000,9
8,109,Omar,AI,29,5,90000,9
11,112,Lily,AI,22,1,61000,8

In [10]:
high_salary = df[df["salary"] > 75000]
high_salary

,employee_id,name,department,age,experience_years,salary,performance_score
5,106,Emma,AI,26,4,82000,9
7,108,Fatima,Web,27,3,76000,8
8,109,Omar,AI,29,5,90000,9

In [11]:
filtered = df[(df["experience_years"] > 2) & (df["performance_score"] >= 8)]
filtered

,employee_id,name,department,age,experience_years,salary,performance_score
5,106,Emma,AI,26,4,82000,9
7,108,Fatima,Web,27,3,76000,8
8,109,Omar,AI,29,5,90000,9

In [12]:

# Salary after 10% tax
df["salary_after_tax"] = df["salary"] * 0.90

# Seniority Level
def seniority(exp):
    if exp < 2:
        return "Junior"
    elif 2 <= exp <= 4:
        return "Mid"
    else:
        return "Senior"

df["seniority_level"] = df["experience_years"].apply(seniority)

df.head()

,employee_id,name,department,age,experience_years,salary,performance_score,salary_after_tax,seniority_level
0,101,Ali,AI,22,1,60000,8,54000.0,Junior
1,102,Sara,Web,25,3,75000,7,67500.0,Mid
2,103,John,AI,24,2,68000,9,61200.0,Mid
3,104,Ayesha,HR,28,5,50000,6,45000.0,Senior
4,105,Bilal,Web,23,1,72000,7,64800.0,Junior

In [13]:
avg_salary = df.groupby("department")["salary"].mean()
print("Average Salary per Department:\n", avg_salary)

Average Salary per Department:
 department
AI     72200.0
HR     52000.0
Web    73500.0
Name: salary, dtype: float64

In [14]:
avg_performance = df.groupby("department")["performance_score"].mean()
print("\nAverage Performance per Department:\n", avg_performance)

Average Performance per Department:
 department
AI     8.600000
HR     5.666667
Web    7.250000
Name: performance_score, dtype: float64

In [15]:
count_dept = df.groupby("department")["employee_id"].count()
print("\nEmployee Count per Department:\n", count_dept)

Employee Count per Department:
 department
AI     5
HR     3
Web    4
Name: employee_id, dtype: int64

In [16]:
highest_salary_dept = avg_salary.idxmax()
print("\nDepartment with Highest Average Salary:", highest_salary_dept)

Department with Highest Average Salary: Web

In [17]:
sorted_df = df.sort_values(by="salary", ascending=False)
sorted_df.head()

,employee_id,name,department,age,experience_years,salary,performance_score,salary_after_tax,seniority_level
8,109,Omar,AI,29,5,90000,9,81000.0,Senior
5,106,Emma,AI,26,4,82000,9,73800.0,Mid
7,108,Fatima,Web,27,3,76000,8,68400.0,Mid
1,102,Sara,Web,25,3,75000,7,67500.0,Mid
4,105,Bilal,Web,23,1,72000,7,64800.0,Junior

In [18]:
top3 = sorted_df.head(3)
top3

,employee_id,name,department,age,experience_years,salary,performance_score,salary_after_tax,seniority_level
8,109,Omar,AI,29,5,90000,9,81000.0,Senior
5,106,Emma,AI,26,4,82000,9,73800.0,Mid
7,108,Fatima,Web,27,3,76000,8,68400.0,Mid

In [19]:
df["salary_rank"] = df["salary"].rank(ascending=False)

df.sort_values(by="salary_rank").head()

,employee_id,name,department,age,experience_years,salary,performance_score,salary_after_tax,seniority_level,salary_rank
8,109,Omar,AI,29,5,90000,9,81000.0,Senior,1.0
5,106,Emma,AI,26,4,82000,9,73800.0,Mid,2.0
7,108,Fatima,Web,27,3,76000,8,68400.0,Mid,3.0
1,102,Sara,Web,25,3,75000,7,67500.0,Mid,4.0
4,105,Bilal,Web,23,1,72000,7,64800.0,Junior,5.0

In [20]:
# Correlation between experience and salary
correlation = df["experience_years"].corr(df["salary"])
print("Correlation between Experience & Salary:", correlation)

# Full correlation matrix
df.corr(numeric_only=True)

Correlation between Experience & Salary: -0.2174410815961451

,employee_id,age,experience_years,salary,performance_score,salary_after_tax,salary_rank
employee_id,1.000000,0.249006,0.208103,0.059745,-0.067294,0.059745,-0.083916
age,0.249006,1.000000,0.976578,-0.145215,-0.439584,-0.145215,0.142872
experience_years,0.208103,0.976578,1.000000,-0.217441,-0.459978,-0.217441,0.220344
salary,0.059745,-0.145215,-0.217441,1.000000,0.729917,1.000000,-0.987313
performance_score,-0.067294,-0.439584,-0.459978,0.729917,1.000000,0.729917,-0.701783
salary_after_tax,0.059745,-0.145215,-0.217441,1.000000,0.729917,1.000000,-0.987313
salary_rank,-0.083916,0.142872,0.220344,-0.987313,-0.701783,-0.987313,1.000000

In [21]:
# Efficiency = performance_score / experience_years
df["efficiency"] = df["performance_score"] / df["experience_years"]

# Most efficient employee
most_efficient = df.sort_values(by="efficiency", ascending=False).head(1)
most_efficient

,employee_id,name,department,age,experience_years,salary,performance_score,salary_after_tax,seniority_level,salary_rank,efficiency
0,101,Ali,AI,22,1,60000,8,54000.0,Junior,9.0,8.0

In [26]:
pivot_table = pd.pivot_table(
    df,
    values="salary",
    index="department",
    aggfunc="mean"
)

pivot_table

             salary
department
AI          72200.0
HR          52000.0
Web         73500.0

In [27]:
df

,employee_id,name,department,age,experience_years,salary,performance_score,salary_after_tax,seniority_level,salary_rank,efficiency
0,101,Ali,AI,22,1,60000,8,54000.0,Junior,9.0,8.000000
1,102,Sara,Web,25,3,75000,7,67500.0,Mid,4.0,2.333333
2,103,John,AI,24,2,68000,9,61200.0,Mid,7.0,4.500000
3,104,Ayesha,HR,28,5,50000,6,45000.0,Senior,12.0,1.200000
4,105,Bilal,Web,23,1,72000,7,64800.0,Junior,5.0,7.000000
5,106,Emma,AI,26,4,82000,9,73800.0,Mid,2.0,2.250000
6,107,David,HR,30,6,52000,5,46800.0,Senior,11.0,0.833333
7,108,Fatima,Web,27,3,76000,8,68400.0,Mid,3.0,2.666667
8,109,Omar,AI,29,5,90000,9,81000.0,Senior,1.0,1.800000
9,110,Sophia,HR,31,7,54000,6,48600.0,Senior,10.0,0.857143
10,111,Hassan,Web,24,2,71000,7,63900.0,Mid,6.0,3.500000
11,112,Lily,AI,22,1,61000,8,54900.0,Junior,8.0,8.000000